Revit 2027 API
DisableAnalyticalModelCB Class
 Disable the analytical model for a structural wall.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureResolution
 Autodesk.Revit.DB.DisableAnalyticalModelCB
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DisableAnalyticalModelCB : FailureResolution
Public Class DisableAnalyticalModelCB
	Inherits FailureResolution
public ref class DisableAnalyticalModelCB : public FailureResolution
type DisableAnalyticalModelCB =
    class
        inherit FailureResolution
    end
The DisableAnalyticalModelCB type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FailureResolution)
Top
Methods
Name | Description
Dispose
(Inherited from FailureResolution)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace